experiments/results/thesis/DPFS-NULL-T4/MT_8/fio_randwrite_16k_128_1_3.out
"randwrite_16k_128_1": (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=io_uring, iodepth=128
fio-3.28
Starting 1 thread

"randwrite_16k_128_1": (groupid=0, jobs=1): err= 0: pid=10902: Thu Aug 10 23:39:49 2023
  write: IOPS=79.2k, BW=1238MiB/s (1298MB/s)(72.5GiB/60002msec); 0 zone resets
    slat (usec): min=2, max=100, avg= 4.39, stdev= 1.72
    clat (usec): min=130, max=9209, avg=1610.13, stdev=687.63
     lat (usec): min=137, max=9213, avg=1614.66, stdev=686.89
    clat percentiles (usec):
     |  1.00th=[  375],  5.00th=[  408], 10.00th=[  429], 20.00th=[ 1516],
     | 30.00th=[ 1582], 40.00th=[ 1631], 50.00th=[ 1713], 60.00th=[ 1762],
     | 70.00th=[ 1811], 80.00th=[ 1909], 90.00th=[ 2057], 95.00th=[ 2868],
     | 99.00th=[ 3359], 99.50th=[ 4047], 99.90th=[ 4686], 99.95th=[ 5276],
     | 99.99th=[ 5997]
   bw (  MiB/s): min= 1186, max= 1245, per=100.00%, avg=1238.18, stdev= 5.32, samples=120
   iops        : min=75930, max=79685, avg=79243.60, stdev=340.60, samples=120
  lat (usec)   : 250=0.02%, 500=17.18%, 750=1.02%, 1000=0.04%
  lat (msec)   : 2=69.20%, 4=11.99%, 10=0.55%
  cpu          : usr=14.33%, sys=32.68%, ctx=303467, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,4754175,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1238MiB/s (1298MB/s), 1238MiB/s-1238MiB/s (1298MB/s-1298MB/s), io=72.5GiB (77.9GB), run=60002-60002msec